<?php

$number1 = 111;

echo "Целочисленная переменная: $number1 \n";

$number2 = 257;

echo "\n Другая целочисленная переменнаня: $number2 \n";

$number_float = 45.3;

echo "\n Число с плавающей запятой: $number_float \n";

// результат
echo "\n Число ", 6 + 6, " нигде не встречалось в коде \n";

// Расчет разницы между тратами за 2 месяца
$lastMonth = 1000;
$thisMonth = 550;

echo "\n Насколько больше я потратил в прошлом месяце, чем в этом месяце? ", $lastMonth - $thisMonth;